app/controllers/home_controller.rb

	def index
		@potions = Potion.limit(20).order created_at: :desc
---
SELECT  "potions".* FROM "potions" ORDER BY "potions"."created_at" DESC LIMIT ?  [["LIMIT", 20]]