app/controllers/potions_controller.rb

	def edit
		@potion = Potion.find(params[:id])
---
SELECT  "potions".* FROM "potions" WHERE "potions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@potion = Potion.find(params[:id])
---
SELECT  "potions".* FROM "potions" WHERE "potions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy
		@potion = Potion.find(params[:id])
---
SELECT  "potions".* FROM "potions" WHERE "potions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]