app/controllers/potions_controller.rb

	def index
		@potions = Potion.limit(1000).order created_at: :desc
---
SELECT  `potions`.* FROM `potions` ORDER BY `potions`.`created_at` DESC LIMIT 1000

	def show
		@potion = Potion.find_by(pot_slug: params[:pot_slug])
---
SELECT  "potions".* FROM "potions" WHERE "potions"."pot_slug" = ? LIMIT ?  [["pot_slug", "love-poison"], ["LIMIT", 1]]

	def edit
		@potion = Potion.find_by(pot_slug: params[:id])
---
SELECT  "potions".* FROM "potions" WHERE "potions"."pot_slug" = ? LIMIT ?  [["pot_slug", "love-poison"], ["LIMIT", 1]]

	def create
		@potion = Potion.new(potion_params)
		if @potion.save
---
INSERT INTO "potions" ("pot_name", "pot_slug", "pot_desc", "pot_img", "pot_creator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		@potion = Potion.find_by(pot_slug: params[:id])
		@potion.update(potion_params)
---
SELECT  "potions".* FROM "potions" WHERE "potions"."pot_slug" = ? LIMIT ?  [["pot_slug", "love-poison"], ["LIMIT", 1]]
UPDATE "potions" SET "pot_desc" = ?, "updated_at" = ? WHERE "potions"."id" = ?  [["pot_desc", "Generic health potion made by Giga Potion Factory."], ["updated_at", 2017-03-02 06:58:15 UTC], ["id", 1]]

	def destroy
		@potion = Potion.find_by(pot_slug: params[:id])
		@potion.destroy
---
SELECT  "potions".* FROM "potions" WHERE "potions"."pot_slug" = ? LIMIT ?  [["pot_slug", "test-potion"], ["LIMIT", 1]]
DELETE FROM "potions" WHERE "potions"."id" = ?  [["id", 2]]